Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཡེ་ཤེས་སྣང་བ་དང་མི་འབྲལ་བར་འགྱུར་བ་དེ་བདག་ལ་བསྟན་དུ་གསོལ། དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དགེ་སློང་ཤིན་ཏུ་བརྟན་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། སངས་རྒྱས་ཀྱི་ཆོས་དང་ཐམས་ཅད་མཁྱེན་པའི་ཆོས་དང་རང་བྱུང་གི་ཆོས་འདྲི་བ་ལེགས་སོ། །
en: When he had said this, the bhikṣu Supratiṣṭhita said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment and that you ask questions about the Buddha’s Dharma, the Dharma of omniscience, the self-arisen Dharma.

source: ལེགས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཐོགས་པ་མེད་པའི་སྒོ་ཐོབ་པ་སྟེ།
en: “Noble one, I have the attainment of the unimpeded gateway, the liberation of a bodhisattva.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་ཐོགས་པ་མེད་པའི་སྒོ་དེ་ཁོ་བོས་བླངས་ཏེ། ཡོངས་སུ་བཟུང་ནས་རྗེས་སུ་འབྲང་ཞིང་རྣམ་པར་དབྱེ་བ་དང་། རྣམ་པར་དཔྱད་པ་དང་རྣམ་པར་བརྟག་པ་དང་སྣང་བར་བྱ་བ་དང་། རབ་ཏུ་སྣང་བར་བྱས་པས་ཐོགས་པ་མེད་པའི་མཐའ་ཞེས་བྱ་བའི་ཡེ་ཤེས་སྣང་བ་ཐོབ་བོ། །དེ་ཐོབ་པས་ཁོ་བོ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་དང་འཆི་འཕོ་ཡོངས་སུ་ཤེས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པར་བྱ་བའི་སྒོར་འཇུག་པ་ལ་ཐོགས་པ་མེད་དོ། །ཕྱི་མའི་མཐའི་བསྐལ་པར་འགྲོ་བ་ཐམས་ཅད་དང་འགྲོགས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །ད་ལྟར་བྱུང་བའི་དུས་ཀྱི་འགྲོ་བ་ཐམས་ཅད་རྣམ་པར་རིག་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་སྐད་དང་། ཀུན་རྫོབ་ཡོངས་སུ་ཤེས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཙོམ་གཅད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ཐ་དད་པར་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་དུས་སུ་འགྲོ་བར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །
en: I have acquired, followed, categorized, analyzed, examined, and elucidated this unimpeded gateway, this liberation of a bodhisattva, and I have attained the light of wisdom called the unimpeded apex.

source: ཉིན་མཚན་དང་སྐད་ཅིག་དང་ཡུད་ཙམ་དང་ཐང་ཅིག་དང་། དུས་ཀྱི་མིང་དུ་བྱ་བ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །དུས་གསུམ་རྒྱ་མཚོའི་རྒྱུད་དུ་འཇུག་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་རང་གི་ལུས་ཀྱིས་རྒྱས་པར་དགང་བར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །དེ་ནི་དེ་ལྟར་དངོས་པོ་མེད་པ་ལ་གནས་ཤིང་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྫུ་འཕྲུལ་ཐོབ་པའི་ཕྱིར་ཏེ།
en: Having attained that, I have no impediment in perceiving the minds and conduct of all beings; I have no impediment in knowing the births and deaths of all beings; I have no impediment in entering the gateway of remembering past lives; I have no impediment in dwelling with all beings in future kalpas; I have no impediment in perceiving all the beings of the present time; I have no impediment in knowing the relative languages of all beings; I have no impediment in cutting through the doubts of all beings; I have no impediment in comprehending the different faculties of all beings; I have no impediment in acting at the right time to ripen and guide all beings; I have no impediment in identifying days, nights, seconds, hours, and periods of time; I have no impediment in entering into the ocean of the three times; and I have no impediment in incorporeally pervading the buddha realms in the ten directions, because I am present without substance and have attained noncomposite miraculous powers.

source: རིགས་ཀྱི་བུ་དངོས་པོ་མེད་པ་ལ་གནས་ཤིང་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྫུ་འཕྲུལ་དེའི་བྱིན་གྱིས་ཁོ་བོ་ནམ་མཁའ་དབྱིངས་འདི་ལས་ཕན་ཚུན་དུ་འགྲོ་ཞིང་འདུག་པ་དང་། སྙེས་པ་དང་སྤྱོད་ལམ་སྣ་ཚོགས་སུ་སྤྱོད་དོ། །
en: “Noble one, because I am present without substance and have the power of noncomposite miraculous powers, I can walk back and forth, stand, sit, lie down, and perform various activities in the sky.

source: མི་སྣང་བར་བྱེད་དོ། །
en: I can become invisible.

source: སྣང་བར་འབྱུང་ངོ་། །
en: I can reappear.

source: དུ་བ་འཐུལ་བར་བྱེད་དོ། །
en: I can become smoke.

source: མེ་ལྕེ་འབར་བར་བྱེད་དོ། །
en: I can become a fire.

source: གཅིག་ཏུ་བྱས་ཤིང་མང་པོར་བསྒྱུར་རོ། །
en: I can transform from one into many.

source: མང་པོར་བྱས་ཤིང་གཅིག་ཏུ་བསྒྱུར་རོ། །
en: I can transform from many into one.

source: སྣང་བ་དང་མི་སྣང་བའང་ཉམས་སུ་མྱོང་བར་བྱེད་དོ། །
en: I can be both visible and invisible.

source: རྩིག་པ་ལའང་ཐག་ཐོགས་མེད་པ་དང་རབ་ལའང་ཐག་ཐོགས་མེད་པར་འགྲོ་སྟེ། དཔེར་ན་ནམ་མཁའ་ལ་བྱ་བཞིན་ནོ། །
en: I can pass without impediment through walls and without impediment through city ramparts, as if through space.

source: ནམ་མཁའ་ལའང་སྐྱིལ་མོ་ཀྲུང་གིས་འགྲོ་སྟེ། དཔེར་ན་འདབ་ཆགས་བྱ་བཞིན་ནོ། །
en: I travel cross-legged through the air, as a bird does.

source: ས་ལ་ཡང་བྱིའུ་ཟུལ་དང་སྟེང་དུ་འབྱུང་བ་བྱེད་དེ། དཔེར་ན་ཆུ་ལ་བྱ་བ་བཞིན་ནོ། །
en: I can plunge into the earth and reappear the way a bird does in water.

source: ཆུ་ལ་ཡང་བྱིང་བ་མེད་པར་འགྲོ་སྟེ། དཔེར་ན་ས་ལ་བྱ་བ་བཞིན་ནོ། །དུ་བ་འཐུལ་བ་དང་།
en: I can walk on water without sinking like a bird on the ground.

source: མེ་ལྕེ་འབར་བར་བྱེད་དེ། དཔེར་ན་མེའི་ཕུང་པོ་ཆེན་པོ་བཞིན་ནོ། །
en: I can produce smoke and flames the way a great fire does.

source: ས་ཡང་ཡོངས་སུ་གཡོ་བར་བྱེད་དོ། །
en: I can make the ground shake.

source: ཉི་མ་དང་ཟླ་བ་འདི་གཉིས་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་དེ་ལྟར་མཐུ་ཆེ་ལ། དེ་ལྟར་གཟི་བརྗིད་ཆེ་ཡང་ལག་པས་ཀུན་ནས་ཡོངས་སུ་ཉུག་གོ །
en: I can wipe clean with my hands this sun and this moon that have such great miraculous power, great mightiness, and great brilliance.

source: ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དག་ཏུ་ཡང་ལུས་ཀྱིས་དབང་བསྒྱུར་རོ། །
en: My body can dominate everywhere up to and including the world of Brahmā.

source: འཇིག་རྟེན་སྤོས་ཀྱི་དུད་པ་ན་བུན་དུ་ཆགས་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཁེབས་པར་བྱས་ཤིང་རབ་ཏུ་འབར་བར་བྱེད་དོ། །
en: I can cover the world with a mist formed from clouds of incense smoke and then make it shine.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་སྤྲིན་གྱི་དྲ་བས་འཇིག་རྟེན་ཀུན་ནས་ཁེབས་པར་བྱས་ཤིང་།
en: I can cover the world with a network of clouds of light rays from all jewels.

source: འགྲོ་བ་ཐམས་ཅད་དང་འདྲ་བའི་སྤྲུལ་པའི་སྤྲིན་རབ་ཏུ་འགྱེད་དོ། །
en: I can send forth a cloud of emanations that resemble all beings.

source: ཁ་དོག་མཐའ་ཡས་པའི་འོད་ཀྱི་དྲ་བའི་སྤྲིན་རབ་ཏུ་བཀྱེ་ཞིང་ཕྱོགས་ཀུན་ཏུ་འང་འགྲོ་སྟེ།
en: “I can emanate clouds of networks of lights of infinite colors that go to all directions and realms.

source: འདི་ལྟར་ཤར་ཕྱོགས་སུ་འགྲོའོ། །ལྷོ་ཕྱོགས་དང་ནུབ་ཕྱོགས་དང་བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་།
en: In that way, they go to the east, to the south, to the west, to the north, to the northeast, to the southeast, to the southwest, to the northwest, downward, and upward.

source: ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་བླའི་ཕྱོགས་སུ་ཡང་འགྲོའོ། །སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་ཡང་ཤར་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཀྱང་འདའོ། །
en: In one instant of mind, they go beyond one world realm in the east.

source: འཇིག་རྟེན་གྱི་ཁམས་གཉིས་དང་བཅུ་ཡང་འདའོ། །འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་དང་།
en: “They go beyond two world realms and ten world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་བརྒྱ་དང་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་།
en: They go beyond a hundred world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་དང་འཇིག་རྟེན་གྱི་ཁམས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་མཚུངས་པ་མེད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་གཞལ་དུ་མེད་པ་དང་།
en: They go beyond a thousand world realms, a hundred thousand world realms, ten million world realms, a billion world realms, a trillion world realms, a quintillion world realms, an incalculable number of world realms, a measureless number of world realms, innumerable world realms, an inconceivable number of world realms, an unequaled number of world realms, an unfathomable number of world realms, an infinite number of world realms, an endless number of world realms, limitless world realms, and an inexpressible number of world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ཏུ་མཐའ་ཡས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་མུ་མེད་པ་དང་འཇིག་རྟེན་གྱི་ཁམས་མཚམས་མེད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ཀྱང་འདའ་བར་བྱེད་དེ། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་ལ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཕྱོགས་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་འདུ་བ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱུང་བ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་སུ་བྱ་བ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སྒོ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བསྐལ་པར་བྱ་བ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་སུ་འཇུག་པ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་རྣམ་པར་བཀོད་པ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་དང་དེ་དག་ན།
en: “All the buddha bhagavats that are present, living, and remaining in those world realms, in that ocean of world realms, in that vast extent of world realms, in the world realms in the directions, in the world realms that are coming to an end, in the world realms that are assembled, in the world realms that are created, in those world realms that are named, in the gateways of those world realms, in the kalpas of those world realms, in the entrances into those world realms, and at the bodhimaṇḍas of those world realms, those buddha bhagavats who are teaching the Dharma in the circle of their assembled followers in those world realms—each of the tathāgatas among those tathāgatas has a variety of bodies that are as numerous as the atoms in the infinite buddha realms.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་ཆོས་སྟོན་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལས་དེ་བཞིན་གཤེགས་པ་རེ་རེ་ཞིང་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ལུས་སྣ་ཚོགས་དང་། ལུས་རེ་རེ་ཞིང་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་མཆོད་པའི་སྤྲིན་གྱི་ཆར་འབེབས་ཤིང་སྤྱན་སྔར་འགྲོའོ། །
en: I approach each of those bodies while sending down a rain from clouds of offering as numerous as the atoms in the infinite buddha realms.

source: དེ་དག་ཏུ་ཕྱིན་ནས་ཀྱང་མེ་ཏོག་ཐམས་ཅད་དང་སྤོས་ཐམས་ཅད་དང་། ཕྲེང་བ་ཐམས་ཅད་དང་ཕྱེ་མ་ཐམས་ཅད་དང་། བྱུག་པ་ཐམས་ཅད་དང་ན་བཟའ་ཐམས་ཅད་དང་། རྒྱལ་མཚན་ཐམས་ཅད་དང་ལྷའི་བ་དན་ཐམས་ཅད་དང་བླ་རེ་ཐམས་ཅད་དང་། དྲ་བ་ཐམས་ཅད་དང་གཟུགས་ཐམས་ཅད་ཀྱི་མཆོད་པ་རྒྱུན་མ་ཆད་པར་བྱེད་དོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་གང་ཇི་སྙེད་དུ་གསུངས་པ་དང་། བསྟན་པ་དང་། བརྗོད་པ་དང་།
en: Having approached them, I make a continuous offering of all flowers, all incense, all garlands, all powders, all ointments, all food, all banners, all flags, all canopies, all networks of beads, and all ornaments.

source: ཡང་དག་པར་བཤད་པ་དང་། ཡང་དག་པར་སྨོས་པ་དང་། ཡོངས་སུ་བརྗོད་པ་དང་། མན་ངག་དུ་གསུངས་པ་དང་། ཤིན་ཏུ་བསྟན་པ་དང་རབ་ཏུ་བརྗོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཤེས་ཤིང་འཛིན་ཏོ། །
en: “I know and remember whatever all those buddha bhagavats say, teach, utter, explain, describe, elucidate, instruct, proclaim, and disclose.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རྗེས་སུ་དྲན་ནོ། །ཤར་ཕྱོགས་སུ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་།
en: “I remember all the pure buddha realms of those buddha bhagavats.

source: ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་སུ་ཡང་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཀྱང་འདའོ། །འཇིག་རྟེན་གྱི་ཁམས་གཉིས་དང་བཅུ་ཡང་འདའོ། །འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་ནས་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་འདའོ། །
en: As it is in the east, so it is in the south, the west, the north, the northeast, the southeast, the southwest, the northwest, above and below, beyond one world realm, beyond two world realms and ten world realms, beyond a hundred world realms, and so on, up to beyond as many world realms as there are atoms in even more innumerable than innumerable buddha realms.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་ལ། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དག་པ་དེ་དང་དེ་དག་ནས། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་དང་དེ་དག་ན་ཆོས་སྟོན་པ་དེ་དག་ཀུན་ཀྱང་མཐོང་ངོ་། །
en: “I see all the buddha bhagavats that are present, living, and remaining in those world realms, in that ocean of world realms, in those pure world realms, who are teaching the Dharma in the circle of their followers.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ལའང་མེ་ཏོག་ཐམས་ཅད་ནས་གཟུགས་ཐམས་ཅད་ཀྱི་བར་གྱི་མཆོད་པ་བྱེད་དོ། །
en: I make offerings to those tathāgatas with all flowers, and so on, up to all ornaments.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་གང་ཇི་སྙེད་དུ་གསུངས་པ་ནས། རབ་ཏུ་བརྗོད་པའི་བར་དེ་དག་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་ཤེས་ཤིང་འཛིན་ཏོ། །
en: I know and remember whatever all those buddha bhagavats say, and so on, and what they disclose.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རྗེས་སུ་དྲན་ནོ། །
en: I remember all the pure buddha realms that there are of those buddha bhagavats.

source: སེམས་ཅན་གང་གིས་ཁོ་བོ་མཐོང་བར་གྱུར་བ་དང་། གང་དང་འགྲོགས་པར་གྱུར་པ་དེ་དག་ཀུན་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་རོ། །
en: “Whatever being sees me, who associates with me, will definitely attain the highest, complete enlightenment.

source: སེམས་ཅན་ཕྲ་མོ་འམ་རགས་པ་འམ་ངན་པའམ་བཟང་བའམ་བདེ་བའམ་མི་བདེ་བ་གང་ཇི་སྙེད་ཅིག་ཁོ་བོས་མཐོང་བར་གྱུར་པ་དེ་དག་ཀུན་ལ་ཡང་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། འདུལ་བའི་དུས་ལས་མི་འདའ་བར་བྱ་བའི་ཕྱིར། ཁོང་ཏ་དེ་དག་གི་ལུས་ཀྱི་ཚད་དང་མཉམ་པར་ལུས་བྱིན་གྱིས་རློབ་བོ། །
en: Whether they are small or huge, good or bad, happy or unhappy beings, however many of them see me, I will bless all of their bodies and I will not let the time to ripen and guide them pass.

source: སེམས་ཅན་ཇི་སྙེད་ཅིག་ཁོ་བོའི་དྲུང་དུ་འོང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་འགྲོ་བ་འདི་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རྣམ་པར་གནོན་པ་དོན་ཡོད་པ་ལ་རབ་ཏུ་གཞོག་གོ །
en: However many beings come before me, I will establish all of them in this bodhisattva liberation that goes everywhere and has fruitful prowess.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཐོགས་པ་མེད་པའི་སྒོ་ཀུན་ཏུ་འགྲོ་བ་དེ་བཞིན་གཤེགས་པའི་མཆོད་པ་དང་། རིམ་གྲོ་རབ་ཏུ་སྦྱོར་བ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། མཐུན་པ་འདི་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོའི་ངང་ཚུལ་ཅན། ཐེག་པ་ཆེན་པོའི་ངང་ཚུལ་ཅན། བྱང་ཆུབ་སེམས་དཔའི་ལམ་དང་མི་འབྲལ་བའི་ངང་ཚུལ་ཅན། ཐོགས་པ་མེད་པའི་ངང་ཚུལ་ཅན།
en: “Noble one, I know only this bodhisattva liberation that goes everywhere, which is dedicated to making offerings and serving the tathāgatas and which is an unimpeded gateway favorable for ripening all beings.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་པའི་སྙིང་པོ་ཆུད་མི་གསོན་པའི་ངང་ཚུལ་ཅན། བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་མི་གཏོང་བའི་ངང་ཚུལ་ཅན། སངས་རྒྱས་ཀྱི་ཆོས་ལ་ལྷག་པར་དམིགས་པའི་ངང་ཚུལ་ཅན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱ་བ་དང་མི་འབྲལ་བའི་ངང་ཚུལ་ཅན། ནམ་མཁའ་དང་མཉམ་པའི་ངང་ཚུལ་ཅན། འཇིག་རྟེན་ཐམས་ཅད་ལ་མི་གནས་པའི་ངང་ཚུལ་ཅན། ཆུད་མི་གསོན་པའི་ངང་ཚུལ་ཅན།
en: “How could I know or describe the qualities of the bodhisattvas who have the conduct of great compassion, who have the conduct of practicing the Mahāyāna, who have the conduct that is never apart from the path of the bodhisattvas, who have unimpeded conduct, who have the conduct of the essence of bodhisattva motivation that is never lost, who have the conduct that never forsakes the aspiration to enlightenment, who have the conduct that is focused on the Buddhadharma, who have the conduct that is never apart from attention to omniscience, who have the conduct that is as vast as space, who have the conduct that is not based on the world, who have the conduct that is never lost, who have the conduct that never deteriorates, who have the conduct that is never impaired, who have the conduct that is never destroyed, who have the conduct that is never adulterated, who have the conduct that is never polluted, who have the conduct that is without regret, who have pure conduct, and who have bodhisattva conduct that is stainless?

source: མཉམས་པའི་ངང་ཚུལ་ཅན། མ་གོད་པའི་ངང་ཚུལ་ཅན། གླགས་མེད་པའི་ངང་ཚུལ་ཅན། མ་འདྲེས་པའི་ངང་ཚུལ་ཅན། རྙོག་པ་མེད་པའི་ངང་ཚུལ་ཅན། འགྱོད་པ་མེད་པའི་ངང་ཚུལ་ཅན། རྣམ་པར་དག་པའི་ངང་ཚུལ་ཅན། བྱང་ཆུབ་སེམས་དཔའ་རྡུལ་དང་བྲལ་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པ་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན། དྲ་བྱི་ལའི་གྲོང་རྡལ་རྡོ་རྗེའི་གྲོང་ཁྱེར་ཅན་བྱ་བ་ཡོད་དེ།
en: In this southern region, in the land of Draviḍa, there is a town called Vajrapura.

source: དེ་ན་དྲ་བྱི་ལའི་སྤྲིན་ཅེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་།
en: There dwells a Dravidian by the name of Megha. Go to him and ask him, ‘How does a bodhisattva train in bodhisattva conduct?

source: ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །
en: How does a bodhisattva practice it?’ ”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་སློང་རབ་ཏུ་བརྟན་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཡང་དང་ཡང་བལྟས་ནས་དགེ་སློང་ཤིན་ཏུ་བརྟན་པའི་དྲུང་ནས་སོང་ངོ་། །
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the bhikṣu Supratiṣṭhita, circumambulated the bhikṣu Supratiṣṭhita to his right a hundred thousand times, and, looking back a hundred thousand times, departed from the bhikṣu Supratiṣṭhita.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཆོས་ཀྱི་དད་པའི་ཤུགས་དང་། བྱིན་གྱིས་ནོན་པ། སངས་རྒྱས་ཡིད་ལ་བྱ་བའི་འདུ་ཤེས་དང་ལྡན་པ། དཀོན་མཆོག་གསུམ་གྱི་གདུང་མི་གཅད་པ་ལ་རབ་ཏུ་བརྩོན་པ།
en: Megha Chapter 7 Sudhana, the head merchant’s son, was filled with the power and might of faith in the Dharma.

source: དུས་གསུམ་སྣང་བས་སེམས་སྣང་བར་གྱུར་པ་སྨོན་ལམ་ཆེན་པོ་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པ་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་ཐབས་ལ་ཞུགས་པ། འདུས་བྱས་ཀྱི་དགེ་བ་ཐམས་ཅད་ལ་མི་གནས་པའི་སེམས་དང་ལྡན་པ། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པར་བྱ་བ་ལ་བརྩོན་པ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་སྦྱང་བའི་སྨོན་ལམ་ལས་མི་གཡོ་བ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ན་གནས་པ་མེད་པར་གནས་པ་ཆོས་ཀྱི་སྣང་བ་དེ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་།
en: He was focused on the idea of following the Buddha; he was sincerely dedicated to the lineage of the Three Jewels; his mind illuminated the worlds of the three times; he was focused on following the great aspiration; he was continuously dedicated to saving all the realms of beings; his mind did not dwell on composite pleasures; he was devoted to contemplating the nature of all phenomena; he never deviated from the aspiration to purify all world realms; he dwelled without attachment in the circles of the assemblies of all the buddhas; he remembered the light of the Dharma; he remembered his kalyāṇamitras; and he proclaimed the lineage of freedom from desire.

source: འདོད་ཆགས་དང་བྲལ་བའི་རིགས་ཡོངས་སུ་བརྗོད་པ་བྱེད་ཅིང་། མཐར་གྱིས་དྲ་བྱི་ལའི་གྲོང་རྡལ་རྡོ་རྗེའི་གྲོང་ཁྱེར་དུ་ཕྱིན་ནས།
en: Eventually he arrived at Vajrapura in the Draviḍa region.

source: དྲ་བྱི་ལའི་སྤྲིན་ཡོངས་སུ་ཚོལ་ཚོལ་བ་ལས།
en: He searched and searched for the Dravidian Megha until he saw him in one of the courtyards in the town.

source: གྲོང་ཁྱེར་གྱི་ཁྱམས་ཤིག་ན་ཆོས་བསྟན་པའི་དོན་དུ་སེང་གེའི་ཁྲིལ་འདུག་ཅིང་། སྲོག་ཆགས་སྟོང་ཕྲག་བཅུ་ཙམ་ཞིག་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་ཡི་གེའི་འཁོར་ལོའི་རྒྱུད་ཀྱི་རྒྱན་ཅེས་བྱ་བ་ཡོངས་སུ་སྟོན་ཅིང་འདུག་པ་མཐོང་ངོ་། །
en: He was seated on a lion throne in order to teach the Dharma, and he was teaching the Dharma teaching called the display of the rotating wheel of syllables to about ten thousand beings.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དྲ་བྱི་ལའི་སྤྲིན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དྲ་བྱི་ལའི་སྤྲིན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་ཀྱི་སེམས་སྲིད་པའི་ལམ་རྒྱུད་ཐམས་ཅད་དུ་ཆབ་མི་འཚལ་བ་དང་། ཇི་ལྟར་ཡོངས་སུ་སྐྱོ་བ་མ་མཆིས་ཤིང་། བསམ་པ་བརྟན་པར་འགྱུར་བ་དང་། ཇི་ལྟར་ཐུབ་པ་མ་མཆིས་ཤིང་ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་པར་འགྱུར་བ་དང་།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the Dravidian Megha, circumambulated the Dravidian Megha to his right many hundreds of thousands of times, sat before him, and with palms together said, “Ārya, I have developed the aspiration for the highest, complete enlightenment.

source: ཇི་ལྟར་ཡོངས་སུ་སྐྱོབ་མ་མཆིས་ཤིང་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་ཡང་དག་པར་སྐྱེ་བར་འགྱུར་བ་དང་ཇི་ལྟར་སྒོ་ཀུན་ནས་རྣམ་པར་དག་ཅིང་གཟུངས་ཀྱི་སྟོབས་གནོན་པར་འགྱུར་བ་དང་། ཇི་ལྟར་མ་རིག་པའི་རབ་རིབ་དང་སྒྲིབ་པ་རྣམ་པར་འཐོར་ཞིང་། ཤེས་རབ་ཀྱི་འོད་ཆོས་ཐམས་ཅད་ལ་རབ་རིབ་མ་མཆིས་པའི་སྣང་བ་སྐྱེ་བར་འགྱུར་བ་དང་། ཇི་ལྟར་དོན་དང་ཆོས་དང་ངེས་པའི་ཚིག་དང་སྤོབས་པ་ལ་མཁས་པའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་རྫོགས་ཤིང་། སོ་སོ་ཡང་དག་པར་རིག་པའི་སྟོབས་གནོན་པར་འགྱུར་བ་དང་། ཇི་ལྟར་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འཁོར་ལོ་ཐ་མི་དད་པ་ཡང་དག་པར་འཛིན་ཅིང་དྲན་པའི་སྟོབས་ཡོངས་སུ་གནོན་པར་འགྱུར་བ་དང་། ཇི་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་ཕྱོགས་རིགས་པའི་སྣང་བ་རྗེས་སུ་རྟོག་ཅིང་། རིག་པའི་སྟོབས་རྣམ་པར་དག་པར་འགྱུར་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཆོས་ཐམས་ཅད་ཀྱི་དོན་རྣམ་པར་གདོན་མི་ཟ་བར་རབ་ཏུ་དབྱེ་བ་ལ་བརྩོན་པས་འགྲུབ་པར་འགྱུར་བ་མ་འཚལ་ཏོ། །
en: However, I do not know how bodhisattvas should train in bodhisattva conduct; how they should practice it; how bodhisattvas do not lose the aspiration to enlightenment; how they keep their motivation firm within all the states of existence so that they do not lose heart; how they purify their resolve so that they do not become oppressed; how they develop the power of great compassion so that they do not lose heart; how they gain the power of retention so that all gateways are purified; how they develop the light of wisdom, the light that frees all phenomena from darkness, so that the darkness that obscures omniscience will be dispersed; how they gain the power of discernment so that they perfect the domain of voice through being skilled in meaning, Dharma, definitions, and eloquence; how they gain the power of memory so that they will possess without differentiation all the Buddha’s Dharma wheels; how they purify states of rebirth so that they will realize and follow the light in all rebirths and phenomena in all directions; and how the power of bodhisattvas’ samādhi is brought forth so as to have the highest certainty and analysis of all the meanings of the Dharma.”

source: དེ་ནས་དྲ་བྱི་ལའི་སྤྲིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་རིམ་གྲོ་བྱ་བའི་ཕྱིར་སེང་གེའི་ཁྲི་དེ་ལས་ལངས་ཏེ་བབས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ལུས་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱས་ནས།
en: Then the Dravidian Megha, in order to show respect to the bodhisattva, rose from his throne, stepped down, and with his entire body prostrated before Sudhana, the head merchant’s son.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་གསེར་གྱི་མེ་ཏོག་གི་ཕུང་པོས་མངོན་པར་གཏོར་ཏོ། །
en: He scattered a heap of golden flowers toward Sudhana, the head merchant’s son.

source: ནོར་བུ་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་མང་པོ་དང་། ཙན་དན་གྱི་ཕྱེ་མ་དམ་པས་ཀྱང་མངོན་པར་གཏོར་ཏོ། །
en: He scattered many priceless precious jewels and supreme sandalwood powder.

source: གོས་ཚོན་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པས་ཁ་དོག་བསྒྱུར་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཀྱང་མངོན་པར་བཀབ་བོ། །
en: He draped him in many hundreds of thousands of cloths that had been dyed in various colors.

source: སྤོས་ཀྱི་མེ་ཏོག་ཁ་དོག་རྣམ་པ་ཐ་དད་ཅིང་ཡིད་དུ་འོང་ལ་བལྟ་ན་སྡུག་པ་མང་པོས་ཀྱང་མངོན་པར་གཏོར་ནས་མཆོད་པའི་རྣམ་པ་སྣ་ཚོགས་གཞན་དག་གིས་ཀྱང་།
en: He scattered many beautiful and delightful perfumed flowers of many different colors.

source: མཆོད་པ་དང་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་བསྟི་སྟང་ཆེར་བྱས་ཏེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: He also made offerings with other kinds of offerings, showing him respect, honor, and veneration.
